{"pageProps":{"postContent":"<p>If someone had told me two years ago that I’d be writing poems on a semi-regular basis I wouldn’t have believed them. Thinking back to my school years poems were something that I especially disliked, as they were so hard to fully grok with a logical and fact-oriented mind. But alas, they seem to become extremely interesting once one starts using feelings to understand the world instead of only logic. But I didn't know that back then.</p>\n<hr>\n<p>Over the last year, big changes happened in my life. My perception of the world and myself evolved a lot for the better and now I welcome much more positivity in my everyday struggles. Some of these changes had their beginning earlier than in 2022 but it was last year that my life shifted the most. I believe three things had the biggest impact: <strong>therapy</strong>, <strong>poem writing</strong> and <strong>regular meditation practice</strong>.</p>\n<h2>Therapy</h2>\n<p>I started going to a therapist sometime in late 2020. At first, it was regular therapy sessions, but after a while I was offered group therapy. I tried it, scared and hesitant at first, but after trying it, it continues to this day. It was (and still is) a wild and eye-opening rollercoaster ride. I had to fully relearn how to approach life and relationships with other people. Over the course of about two years, I took part in four consecutive group therapies, each of them being about five months long. The interesting take is that after finishing each one of them I felt different but unsure whether another one would give me much. But every single time starting a new therapy gave me even more insight into myself so I kept doing it.</p>\n<p>As my final therapy is close to end, I’m leaving it as a much more confident man, less dependent on other people, yet so much more appreciative of their company and friendship. I have learned that a lot of emotional processing, emotional intelligence and the ability to be in good and trustworthy relationships with other people, is much closer to skill than knowledge. And as such it has important skill-like qualities:</p>\n<ol>\n<li>You learn it by trying, doing, failing and repeating. By getting angry, feeling the anger, talking about it to somebody, accepting it and moving on.</li>\n<li>it is really hard to fully understand it only via mind and intelligence and it is hard to pass this newly gained ability to someone else. Exactly like you can’t just give your friend your skill to kick a football or to ice skate.</li>\n</ol>\n<p>After absorbing these ideas a lot of other elements of therapy clicked into place for me. It suddenly made sense why just talking to other people during therapy about one’s feelings is actually helpful. Sharing anger, sadness, fear or shame with someone else often allows us to truly feel it in ourselves. Now that I can feel these emotions I am actually able to move forward, whereas in the past I would think about said emotions but move exactly nowhere. Armed with these insights and a handful of others, I’m looking at the world and it really seems like a much brighter world now.</p>\n<h2>Poems</h2>\n<p>At the beginning of therapy, however, nothing was so simple and I kept constantly feeling overwhelmed by emotions and unable to process them. This is when I decided to try and write some poems.</p>\n<p>It started just randomly: me getting down to put words onto paper (actually on a keyboard) and to see if this process would help me at all. After some initial trial and error it seemed to make sense, and I did feel better after pouring out what I felt and transforming it into words. It was as if I took something from inside me that I did not fully understand and lay it out and turn it into something different and new. In the beginning, my poems were quite simple and crude. I also decided to write them in Polish - it seemed the most natural thing to do. After a few months of writing I started to find not only solace in the act of writing them but also actual joy. I began to spend more time and put more work into poems to make them a bit more interesting and better composed.</p>\n<p>In the course of the last year, I've written fourteen poems, some of them rhyme and some don’t. A lot of them were about the feeling of sadness and fear which dominated my head and my body for some time. But there are others - poems of longing, of searching and finding new life, of courage and love. While some of them are certainly lacking, it came as a big shock to me that I actually <em>could write</em>. This act of writing is a source of very peculiar satisfaction that is unique to anything else in my life.</p>\n<h2>Meditation</h2>\n<p>Around last summer I tried meditating for the first time. Curious, yet unsure whether it would fit me, I picked a meditation app since I had almost no knowledge about the topic. The chosen app was “Waking up” and it offered a nice mix of theory and guided meditations. And so I slowly started to learn about different meditation practices, mindfulness and a slew of other related topics.</p>\n<p>In the beginning, it was difficult to just sit down and try to practice as my mind would race thinking about everything and nothing. It was hard.</p>\n<p>Over the course of several months, however, it was slowly becoming easier. Noticing emotions in my body, noticing thoughts in my head and just looking at them started to come more naturally. This practice helped me see how I was constantly trying to handle my life, my emotions and my problems through thinking. In the past that would be my default. To keep thinking obsessively and coming up with improvements was my only way of solving any sort of obstacles. But clearly there were problems I simply couldn’t solve that way (or we wouldn’t be reading this blog post now).</p>\n<p>Meditation and mindfulness changed my way of approaching these things completely and helped me learn much more about myself. It brought me more calmness and lessened the worry about problems and also gave me much more insight into myself. I now try to do a bit of practice every day and it is something I grew fond of.</p>\n<hr>\n<p>All of the above were immensely helpful in dealing with problems, both of everyday and of more existential nature. What is interesting is that in my experience all three concepts complemented each other in a great way, and I got more from them than from the sum of the parts.</p>\n<p>Therapy taught me what emotions are and how I can become better at noticing my emotions, but poem writing helped me deal with the heaviest of them.<br>\nGroup therapy let me have better relationships with other people and meditation allowed me to have a better relationship with myself, that is to say to try and be less reliant on ego but more noticing of the present moment.<br>\nFinally, writing continues to be hard but interesting. The act of creating something, even something as simple as this post, is an extremely rewarding experience. I find it to be a nice change, creating instead of consuming which seems to be the default these days.</p>\n<p>It was a long journey and most likely it had started much earlier than I’m assuming it did.<br>\nIt is true that changes of this kind never come easily nor quickly, but once they start coming it is difficult to stop them. We are our own greatest enemies which is both terrifying and fascinating. Once we get to know ourselves fully and we are able to overcome our limits, the quality of life will definitely improve. Life will still be challenging from time to time, and difficult emotions will come, but I have learned that with a proper mindset and training they can be accepted and channeled into something good.</p>\n<p>In the end, I think it is not a question of whether the glass is half full or half empty, but rather whether we can see the glass as it is and then move forward in life just accepting things as they are.</p>\n<p>To close this, I find this quote from one of my favorite fictional characters very fitting:</p>\n<blockquote>\n<p>Life happens wherever you are, whether you make it or not.\n<em>Uncle Iroh (Avatar: The Last Airbender)</em></p>\n</blockquote>\n","title":"A year of change","date":"2023-03-01"},"__N_SSG":true}