{"pageProps":{"postContent":"<p>Kiedy byłem dzieckiem zazdrościłem dorosłym i wyobrażałem sobie, że ich życie jest dużo lepsze niż moje - dziecięce. Przecież tam gdzie dzieci mają głównie ograniczenia i zakazy to dorośli “mogą wszystko”. Rodzice pytani o to zazwyczaj odpowiadają dziecku, że życie w dorosłości to ciągłe obowiązki, dużo pracy i ciągły brak czasu. <em>“Jeszcze zobaczysz jak jest ciężko”</em> - wydaje się być frazą, którą mogłem wtedy od nich słyszeć, ale myślę, że inni w trakcie swojego dzieciństwa mogli usłyszeć coś podobnego.<br>\nPiszę te słowa mając niecałe 32 lata i sądzę, że dopiero niedawno w pełni zrozumiałem co odróżnia osobę dorosłą od dziecka. A właściwie co odróżnia osobę <strong>dojrzałą</strong> od dziecka - dorosła to słowo które niekoniecznie pasuje do tego kontekstu.</p>\n<p>To co ich odróżnia, to branie odpowiedzialności za własne życie.</p>\n<hr>\n<h2>Branie odpowiedzialności za swoje życie</h2>\n<p>Odpowiedzialność to słowo które ma bardzo wiele znaczeń. To co dawniej kojarzyło mi się z odpowiedzialnością to głównie: <em>konsekwencje</em>, <em>powaga</em>, <em>dopasowanie się do sytuacji, przeliczanie zysków i strat, ryzyka i nagród, stanięcie na wysokości zadania</em>.<br>\nTeraz, kiedy miałem czas i wsparcie żeby dokładniej to przemyśleć, obok tamtych skojarzeń doszło coś więcej: <em>przewodnictwo, sprawczość, wybór</em>.<br>\nKiedy patrzę na to z perspektywy czasu to wydaje mi się ciekawe jak bardzo ten pierwszy zestaw skojarzeń można powiązać z ograniczeniami, z czymś co wydaje się nam negatywne. Mam wrażenie, że do tego drugiego zestawu trzeba dojrzeć. On już nie jest negatywny - jest dużo przyjemniejszy w wydźwięku.<br>\nOdpowiedzialność to wolność.</p>\n<p>Odpowiedzialność za swoje życie to coś więcej niż te wcześniej wymienione słowa. To wzięcie we własne ręce kierownicy do życia i uwierzenie (zrozumienie, pogodzenie się), że możemy zrobić co tylko chcemy. To danie sobie samemu przywileju i zaufanie sobie, że to my jesteśmy odpowiedzialni sami za siebie. To pozwolenie sobie żyć tak jak chcemy, bez patrzenia na innych. Opinie innych mogą być cenną wskazówką, żeby żyć dobrze i w pokoju, ale nadmierne przesiąknięcie nimi to - moim zdaniem - błąd. I popełniałem ten błąd przez znaczną większość czasu który przeżyłem i dopiero teraz zaczynam czuć, że można inaczej.<br>\nPodobno lepiej późno niż wcale.</p>\n<h2>Godzenie się na życie takie jakie jest</h2>\n<p>Odpowiedzialność w takim znaczeniu sprawia, że łatwiej pojąć, że to my i tylko my odpowiadamy za to jak nam idzie życie. Czy robimy to co chcemy robić, czy robimy to co inni chcą? Bardzo ważnym momentem dla mnie było zrozumienie, że uzależnienie się od tego co inni chcą czy oczekują, to tak naprawdę tylko moje (nasze) wymówki. Bardzo łatwo jest powiedzieć sobie, że czegoś nie możemy zrobić ponieważ “nie wypada” lub nie będzie to zaakceptowane bądź tak zostaliśmy wychowani. To jednak w większości przypadków brednie, i to właśnie, przez tak długo powstrzymywało mnie od życia za siebie tak jak chcę.\nWierzę, że możemy zrobić bardzo wiele, a bardzo niewiele musimy. Odnajdywanie tego co naprawdę chcemy zrobić może być piękną przygodą.</p>\n<p>Prawdziwa odpowiedzialność to również, a może przede wszystkim, pogodzenie się z tym, że w naszym życiu nie każdy musi nas lubić. Wszystkie nasze czyny będą miały konsekwencje, ale nie wszystkie konsekwencje są na tyle straszne żeby się ich ciągle bać.\nKiedy patrzę na różne przeżycia z mojej przeszłości to najbardziej doceniam te, które zdarzyły się bo nie bałem się tego co będzie tylko zaryzykowałem, a najbardziej żałuję tych kiedy potencjalne konsekwencje sparaliżowały mnie i nie pozwoliły czegoś zrobić. Życie to odkrywanie i testowanie i próbowanie nawet jak nam nie wychodzi.</p>\n<p>I chociaż ważne żebyśmy żyli tak jak chcemy i nie przejmowali się zbytnio tym co myślą o nas inni, to ważne żeby jednak otoczyć się ludźmi, którzy będą potrafili powiedzieć nam gdy robimy coś bardzo bezsensownego lub głupiego. Opinie i uczucia innych ludzi to świetny drogowskaz ale przewodnikiem naszego życia powinniśmy być my.</p>\n<hr>\n<p>Ten wpis był trudny i powstawał długo z przerwami wielodniowymi albo tygodniowymi. Mam nadzieję, że czytanie go da komuś chociaż odrobinę uwolnienia, tak jak mi dało pisanie go.</p>\n","title":"Uczenie się dorosłości po 30tce","date":"2021-08-04"},"__N_SSG":true}