{"pageProps":{"postContent":"<p><em>The very first post.</em></p>\n<p>I have created this blog mostly as an experiment in coding, and I feel quite happy with how this turned out.<br>\nI was able to learn some new libraries, try out <strong>TypeScript</strong> on my own (without other people in the project doing the harder stuff) and touch every part of the process: the idea, the (simple) design, code, and finally deployment.</p>\n<p>That being said, since this is a blog, I wanted to share some of my thoughts related to the process of creating it.</p>\n<hr>\n<h2>About the title</h2>\n<p>Current title is still a work in progress.</p>\n<p>The general idea, a <em>motif</em> if you will, that I wanted the title to include was this:\nI have <strong>so many thoughts</strong> inside my head and my mind often wanders, thinking of the weirdest things in the weirdest moments of my life.</p>\n<p>My interests are numerous, and include: tech, coding, psychology/cognitive sciences, physics, maths, pop culture, comic books, movies and cinema and many more. I'm unfortunately not really knowledgeable in all of those topics, I am however extremely interested in all of them.<br>\nBecause of that there is no single idea, thing, or topic which I could base the name off. I didn't really want a catchy one word title and I couldn't come up with anything witty or awesome.<br>\nI wanted something that groups all this together.</p>\n<h3>Some other ideas</h3>\n<ul>\n<li><em>thoughts in my head</em></li>\n<li><em>things in my head</em></li>\n<li><em>stuff in my head</em></li>\n</ul>\n<p>These seemed either too simple <em>(thoughts)</em> or too silly sounding <em>(stuff)</em>. So I settled for a simple \"<em>worlds in my head</em>\".</p>\n<p>It's quite possible that I will change this in future.</p>\n<h2>About the design</h2>\n<p>I'm not very good at coming up with graphic designs and UI. The most important thing for me was for the layout of this blog to be extremely clean and simple.<br>\nContent is most important, and the rest should just enhance the content and make it easy to read. Also I wanted to make sure this looks good on all screen sizes.</p>\n<p>The main resource I used was this awesome interactive article that I found:</p>\n<p><a href=\"https://jgthms.com/web-design-in-4-minutes/\">web design in 4 minutes</a></p>\n<p>This has served as the backbone of the styling and helped me make sure that the thing was clean and readable.<br>\nIn general I tried to keep the amount of style rules to a minimum.</p>\n<p>In addition my main inspiration for this was Dan Abramov's blog - <a href=\"https://overreacted.io/\">Overreacted</a>.</p>\n<h2>About the tech</h2>\n<p>You can read all about the technical details in the <code>README</code> for this project on my github:</p>\n<p><a href=\"https://github.com/Kicu/blog\">https://github.com/Kicu/blog</a>.</p>\n","title":"Hello world!","date":"2021-03-31"},"__N_SSG":true}